{
    "intro": "I have been working in the space Industry for over five years with a thirst to learn new things every day. 
            I am a System Integration Engineer skilled in developing RF system and avionics hardware for space and aviation applications. 
            Currently (udpated May 2023), I am working at Drone Delivery Canada, developing delivery drones.",
    "career": [
      {
        "position": "Senior Radio Frequency Engineer",
        "company": "SpaceRyde",
        "duration": "Sep 2021 - Feb 2023",
        "location": "Toronto",
        "responsibilities": [
          "Led comprehensive design, assembly, integration, and testing of a rocket's avionics system, ensuring compliance with IPC-610, IPC-620, and MIL-spec standards.",
          "Managed procurement and integration of hardware for the electric propulsion system of a stratospheric balloon gondola.",
          "Developed an end-to-end RF system for rocket telemetry, adhering to the IRIG-106 standard, and overseeing ground station integration and operation.",
          "Designed, assembled, and tested PCBs using Altium Circuit Studio, including STM32 MCU interfacing with vital flight components.",
          "Directed development of functional and integration test procedures, validating avionics components against MIL-STD-810.",
          "Performed conceptual design, performance simulations, and trade-off studies using Python and MATLAB.",
          "Generated comprehensive system requirements for avionics component development.",
          "Coordinated with regulatory authority ISED to secure radio licensing for rocket telemetry spectrum."
        ]
      },
      {
        "position": "Intermediate Radio Frequency Engineer",
        "company": "SMT Research",
        "duration": "Apr 2020 - Aug 2021",
        "location": "Vancouver",
        "responsibilities": [
          "Implemented an RF power harvesting wireless system for structural monitoring, and developed a wireless range simulator using MATLAB.",
          "Innovated custom RFID passive sensor tags for remote data logging and location tracking, including prototype circuit simulation and PCB design.",
          "Installed sensors and DAQs in active construction sites, providing crucial technical support to technicians.",
          "Conducted debugging and qualification of PCBs prior to customer delivery, adhering to IPC-610 standards.",
          "Validated RF propagation through various roof assemblies using Lime-SDR radio."
        ]
      },
      {
        "position": "Radio Frequency Engineer",
        "company": "Helios Wire",
        "duration": "Jul 2017 - May 2019",
        "location": "Vancouver",
        "responsibilities": [
          "Designed, simulated, and deployed C, X, and S-Band antennas for CubeSat TT&C communication.",
          "Conceptualized and modeled an IoT gateway for interfacing between Cubesat in space and IoT tags on the ground, conducting dynamic simulations in Solidworks.",
          "Managed invoicing and purchase orders, negotiating pricing and terms for large-volume purchases.",
          "Produced technical specifications, drawings, and internal research papers to present key findings to management."
        ]
      }
    ],
    "projects": [
      {
        "name": "Starship",
        "description": "Starship is a fully reusable spacecraft..."
      },
      {
        "name": "Tesla Model S",
        "description": "The Model S is a range of all-electric cars..."
      },
      {
        "name": "Neuralink",
        "description": "Neuralink is a neurotechnology company..."
      }
    ]
  }
  